{
  "add_bos_token": true,
  "add_eos_token": false,
  "bos_token": "<|begin_of_text|>",
  "chat_template": "{{- bos_token }}\n{%- if messages[0]['role'] == 'system' %}\n    {%- set system_message = messages[0]['content']|trim %}\n    {%- set messages = messages[1:] %}\n{%- else %}\n    {%- set system_message = '' %}\n{%- endif %}\n\n{{- '<|start_header_id|>system<|end_header_id|>\\n\\n' }}\n{{- system_message }}\n{{- '<|eot_id|>' }}\n\n{%- for message in messages %}\n    {{- '<|start_header_id|>' + message['role'] + '<|end_header_id|>\\n\\n'+ message['content'] | trim + '<|eot_id|>' }}\n{%- endfor %}\n{%- if add_generation_prompt %}\n    {{- '<|start_header_id|>assistant<|end_header_id|>\\n\\n' }}\n{%- endif %}\n",
  "clean_up_tokenization_spaces": true,
  "eos_token": "<|eot_id|>",
  "model_input_names": ["input_ids", "attention_mask"],
  "model_max_length": 131072,
  "pad_token": "<|finetune_right_pad_id|>",
  "padding_side": "right",
  "tokenizer_class": "PreTrainedTokenizerFast"
}
